
#include <ioCC2530.h> /*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
* 文件名  ： main
* 作者    ： lihaojie
* 版本    ： V1.0.0
* 时间    ： 2019/9/17
* 简要    ： 文件说明  
********************************************************************
* 副本
*
*>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>*/




#define LED1 P1_0     // P1_0定义为P1.0
#define LED2 P1_1     // P1_1定义为P1.1


unsigned int temp = 0;
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名：unsigned int time
* 参数：i
* 返回：void
* 描述：延时函数
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void unsigned int time(i)

//1ms精确定时
void delay(unsigned int time)
{
    unsigned int i = 0;
    unsigned int j;
for(i = 0; i < time; i++)
{
for(j = 0; j < 475; j++)
{   
    asm("NOP");   
    asm("NOP");
    asm("NOP");

}  
}  
}

void main(void)/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
* 函数名：main
* 参数：void
* 返回：void
* 描述：主函数
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void main(void)
{
    P1SEL &= ~0x03;
    P1DIR |= 0x03 ;   
while(1)
{
    LED1 = 1;    
    LED2 = 0;    
    delay(1000);
    LED1 = 0;    
    LED2 = 1;    
    delay(1000);
}    
}
